import classes from '../static.module.scss';

const TermsConditions = () => {
    return (
        <div className={classes.container}>
            <h2 className={classes.title}>
                شروط وأحكام تطبيق تربتي:
            </h2>

            <p className={classes.paragraph}>
                شكرًا لاستخدامك تطبيق تربتي. يرجى قراءة الشروط والأحكام التالية بعناية قبل استخدام التطبيق.
            </p>

            <ol>
                <li>
                    <h3 className={classes.heading}>
                        المسؤولية:
                    </h3>
                    <p className={classes.paragraph}>
                        أنت تتحمل المسؤولية الكاملة عن استخدامك لتطبيق تربتي وأي تداعيات قد تنشأ عن استخدامك للتطبيق. نحن غير مسؤولين عن أي خسائر أو أضرار قد تحدث لك أو لأي طرف ثالث نتيجة لاستخدامك للتطبيق.
                    </p>
                </li>
                <li>
                    <h3 className={classes.heading}>
                        البيانات الشخصية:
                    </h3>
                    <p className={classes.paragraph}>
                        نحن نحترم خصوصية معلوماتك الشخصية. عند استخدامك لتطبيق تربتي، فإنك توافق على جمع ومعالجة وتخزين المعلومات الشخصية الخاصة بك وفقًا لسياسة الخصوصية الخاصة بنا.
                    </p>
                </li>
                <li>
                    <h3 className={classes.heading}>
                        المحتوى:
                    </h3>
                    <p className={classes.paragraph}>
                        عند استخدامك لتطبيق تربتي، يجب أن تلتزم بعدم نشر أو تبادل أي محتوى مسيء أو غير قانوني أو مسيء أو مخالف لحقوق الملكية الفكرية للآخرين. نحن نحتفظ بالحق في حذف أي محتوى ينتهك هذه الشروط.
                    </p>
                </li>
                <li>
                    <h3 className={classes.heading}>
                        الدفع والرسوم:
                    </h3>
                    <p className={classes.paragraph}>
                        قد يتطلب استخدام بعض الميزات في تطبيق تربتي دفعًا أو رسومًا. يجب عليك دفع هذه الرسوم وفقًا للطرق المحددة في التطبيق. قد تخضع هذه الرسوم للتغيير وفقًا لتقديرنا الخاص.
                    </p>
                </li>
                <li>
                    <h3 className={classes.heading}>
                        إنهاء الاتفاقية:
                    </h3>
                    <p className={classes.paragraph}>
                        يحق لنا إنهاء اتفاقية استخدام تطبيق تربتي في أي وقت ودون إشعار مسبق إذا انتهكت هذه الشروط والأحكام. يحق لك أيضًا إنهاء الاتفاقية بإيقاف استخدامك للتطبيق.
                    </p>
                </li>
                <li>
                    <h3 className={classes.heading}>
                        التعديلات والتحديثات:
                    </h3>
                    <p className={classes.paragraph}>
                        نحتفظ بالحق في تعديل أو تحديث شروط وأحكام استخدام تطبيق تربتي في أي وقت. سيتم إشعارك بأي تغييرات عن طريق إشعار داخل التطبيق. يجب عليك مراجعة الشروط والأحكام بانتظام.
                    </p>
                </li>
                <li>
                    <h3 className={classes.heading}>
                        التغييرات على الشروط  والاحكام:
                    </h3>
                    <p className={classes.paragraph}>
                        نحتفظ بالحق في تعديل الشروط  والاحكام في أي وقت. ستكون أي تغييرات سارية فور نشرها على موقعنا الإلكتروني أو داخل التطبيق. يعتبر استخدامك المستمر لـ "تربتي" بعد أي تغييرات مثل قبولك للشروط  والاحكام.
                    </p>
                </li>
            </ol>

            <div className={classes.instructions}>
                <p className={classes.paragraph}>
                    إذا كان لديك أي أسئلة أو استفسارات حول سياسة الاستخدام لدينا، يرجى الاتصال بنا على info@tripty.app
                </p>

                <p className={classes.paragraph}>
                    شكرًا لاستخدامك "تربتي". نأمل أن يكون التطبيق مفيدًا لك في رحلتك وطلعتك .
                </p>
            </div>
        </div>
    )
}

export default TermsConditions;