import classes from '../static.module.scss';

const PrivacyPolicyCom = () => {
    return (
        <div className={classes.container}>
            <h2 className={classes.title}>
                سياسة الاستخدام لتطبيق "تربتي"
            </h2>

            <p className={classes.paragraph}>
                شكرًا لاستخدامك تطبيق "تربتي". يرجى قراءة سياسة الاستخدام التالية بعناية قبل استخدام التطبيق.
            </p>

            <ol>
                <li>
                    <h3 className={classes.heading}>
                        الاستخدام الشخصي:
                    </h3>
                    <p className={classes.paragraph}>
                        تطبيق "تربتي" مصمم للاستخدام الشخصي فقط. يجب عليك عدم استخدام التطبيق لأي غرض تجاري أو توزيع المحتوى الموجود فيه بدون إذن مسبق منا.
                    </p>
                </li>
                <li>
                    <h3 className={classes.heading}>
                        المحتوى:
                    </h3>
                    <p className={classes.paragraph}>
                        تطبيق "تربتي" يوفر محتوى ترفيهي ومعلوماتي للمستخدمين. يرجى ملاحظة أن جميع المحتوى المقدم هو لأغراض إرشادية فقط ولا يشكل نصيحة قانونية أو طبية أو مالية أو أي نصيحة مهنية أخرى. يجب عليك استشارة متخصص في المجال المعني قبل اتخاذ أي قرار أو اتخاذ أي إجراء بناءً على المحتوى المقدم.
                    </p>
                </li>
                <li>
                    <h3 className={classes.heading}>
                        الملكية الفكرية:
                    </h3>
                    <p className={classes.paragraph}>
                        جميع حقوق الملكية الفكرية المتعلقة بتطبيق "تربتي" ومحتواه تنتمي إلينا أو للأطراف الثالثة المرخصة لنا. يُحظر نسخ أو توزيع أو نقل أو تعديل أو استخدام أي جزء من التطبيق أو المحتوى بدون إذن خطي منا.
                    </p>
                </li>
                <li>
                    <h3 className={classes.heading}>
                        التصرف غير المسموح به:
                    </h3>
                    <p className={classes.paragraph}>
                        يُحظر استخدام تطبيق "تربتي" بأي طريقة تنتهك القوانين المحلية أو الدولية. يجب عليك عدم القيام بأي من الأفعال التالية:<br />
                        - نشر أو نشر المحتوى المسيء أو المسيء أو العنصري أو الجنسي أو العنف أو التحريض على الكراهية.<br />
                        - التلاعب أو تعطيل تطبيق "تربتي" أو أي جزء منه.<br />
                        - استخدام أي برامج أو أدوات تهدف إلى تجاوز أو تجاوز الإجراءات الأمنية للتطبيق.
                    </p>
                </li>
                <li>
                    <h3 className={classes.heading}>
                        التعويض:
                    </h3>
                    <p className={classes.paragraph}>
                        باستخدام تطبيق "تربتي"، فإنك توافق على تعويضنا وحمايتنا وإبقاءنا بريئين من أي مطالبة أو خسارة أو ضرر أو مسؤولية تنشأ عن استخدامك للتطبيق أو انتهاكك لهذه السياسة.
                    </p>
                </li>
                <li>
                    <h3 className={classes.heading}>
                        التغييرات على سياسة الاستخدام:
                    </h3>
                    <p className={classes.paragraph}>
                        نحتفظ بالحق في تعديل سياسة الاستخدام في أي وقت. ستكون أي تغييرات سارية فور نشر السياسة المحدثة على موقعنا الإلكتروني أو داخل التطبيق. يعتبر استخدامك المستمر لـ "تربتي" بعد أي تغييرات مثل قبولك للسياسة المعدلة.
                    </p>
                </li>
            </ol>
            <h2 className={classes.title}>
                سياسة الخصوصية لتطبيق "تربتي"
            </h2>

            <p className={classes.paragraph}>
                في "تربتي"، نحرص على حماية خصوصيتك وضمان أمان معلوماتك الشخصية. توضح هذه السياسة كيفية جمعنا واستخدامنا وحمايتنا لبياناتك عند استخدامك لتطبيقنا. من خلال استخدام "تربتي"، وفقا  للممارسات  الموضحة في هذه السياسة.
            </p>

            <ol>
                <li>
                    <h3 className={classes.heading}>
                        جمع المعلومات:
                    </h3>
                    <p className={classes.paragraph}>
                        قد نجمع أنواعًا معينة من المعلومات عند استخدامك لتطبيقنا، بما في ذلك على سبيل المثال لا الحصر:<br />
                        - المعلومات الشخصية: مثل اسمك وعنوان بريدك الإلكتروني وتفاصيل الاتصال الأخرى.<br />
                        - بيانات الاستخدام: مثل معلومات جهازك وعنوان IP ونوع المتصفح ونظام التشغيل.<br />
                        - المحتوى الذي تنشئه المستخدم: مثل التعليقات والملاحظات وأي معلومات أخرى تختار تقديمها.<br />
                    </p>
                </li>
                <li>
                    <h3 className={classes.heading}>
                        استخدام المعلومات:
                    </h3>
                    <p className={classes.paragraph}>
                        نستخدم المعلومات المجمعة للقيام بما يلي:<br />
                        - توفير وتحسين خدماتنا، بما في ذلك التوصيات والمحتوى المخصص.<br />
                        - التواصل معك والرد على استفساراتك وإرسال التحديثات الهامة.<br />
                        - تحليل أنماط الاستخدام والاتجاهات لتعزيز تجربة المستخدم وتحسين تطبيقنا.<br />
                        - الحماية من الأنشطة الاحتيالية أو غير المصرح بها.
                    </p>
                </li>
                <li>
                    <h3 className={classes.heading}>
                        مشاركة البيانات:
                    </h3>
                    <p className={classes.paragraph}>
                        قد نشارك معلوماتك مع أطراف ثالثة في الحالات التالية:<br />
                        - بموافقتك: قد نشارك معلوماتك مع أطراف ثالثة إذا منحتنا إذنًا صريحًا لذلك.<br />
                        - مقدمي الخدمات: قد نستعين بمقدمي خدمات طرف ثالث لأداء وظائف معينة نيابة عنا، مثل تحليل البيانات أو دعم العملاء.<br />
                        - المتطلبات القانونية: قد نكشف عن معلوماتك إذا كانت مطلوبة بموجب القانون أو استجابة لطلب قانوني صالح.
                    </p>
                </li>
                <li>
                    <h3 className={classes.heading}>
                        أمان البيانات:
                    </h3>
                    <p className={classes.paragraph}>
                        نقوم بتنفيذ تدابير أمان مناسبة لحماية معلوماتك الشخصية من الوصول غير المصرح به أو التعديل أو الكشف عنه. ومع ذلك، يرجى ملاحظة أنه لا يوجد أي طريقة لنقل البيانات عبر الإنترنت أو تخزينها إلكترونيًا تكون 100٪ آمنة.
                    </p>
                </li>
                <li>
                    <h3 className={classes.heading}>
                        خصوصية الأطفال:
                    </h3>
                    <p className={classes.paragraph}>
                        لا نقوم بجمع أو طلب معلومات شخصية من الأطفال دون سن 13 عامًا. إذا كنت تعتقد أننا قد جمعنا معلومات شخصية عن طفل، يرجى الاتصال بنا على الفور وسنتخذ إجراءات لإزالة هذه المعلومات.
                    </p>
                </li>
                <li>
                    <h3 className={classes.heading}>
                        تغييرات على سياسة الخصوصية:
                    </h3>
                    <p className={classes.paragraph}>
                        نحتفظ بالحق في تعديل سياسة الخصوصية في أي وقت. ستكون أي تغييرات سارية فور نشر السياسة المحدثة على موقعنا الإلكتروني أو داخل التطبيق. يعتبر استخدامك المستمر لـ "تربتي" بعد أي تغييرات مثل قبولك للسياسة المعدلة.
                    </p>
                </li>
            </ol>

            <div className={classes.instructions}>
                <p className={classes.paragraph}>
                    إذا كان لديك أي أسئلة أو استفسارات حول سياسة الاستخدام لدينا، يرجى الاتصال بنا على info@tripty.app
                </p>

                <p className={classes.paragraph}>
                    شكرًا لاستخدامك "تربتي". نأمل أن يكون التطبيق مفيدًا لك في رحلتك وطلعتك .
                </p>
            </div>
        </div>
    )
}

export default PrivacyPolicyCom;